{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"inputs": {"hand_tower_input:0": {"name": "hand_tower_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "21"}, {"size": "3"}]}}, "face_tower_input:0": {"name": "face_tower_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "468"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "face_tower_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "468"}, {"size": "3"}]}}}}, {"name": "hand_tower_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "21"}, {"size": "3"}]}}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^face_tower_input", "^hand_tower_input"]}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Reshape_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Shape", "op": "Shape", "input": ["hand_tower_input", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/flatten_28/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_70/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_70/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/axes", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Reshape_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Shape", "op": "Shape", "input": ["face_tower_input", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/free", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/flatten_29/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_72/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "14976"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_72/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/tf_op_layer_concat_4/concat_4/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/classifier/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/classifier/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/Shape", "StatefulPartitionedCall/model_4/dense_69/Tensordot/axes", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/Shape", "StatefulPartitionedCall/model_4/dense_69/Tensordot/free", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/Shape", "StatefulPartitionedCall/model_4/dense_69/Tensordot/axes", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/Shape", "StatefulPartitionedCall/model_4/dense_69/Tensordot/free", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat", "op": "NoOp", "input": ["^StatefulPartitionedCall/model_4/dense_69/Tensordot/axes", "^StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis", "^StatefulPartitionedCall/model_4/dense_69/Tensordot/free"]}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const_2", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/GatherV2", "StatefulPartitionedCall/model_4/dense_71/Tensordot/Const_2", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/Prod", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/Prod", "StatefulPartitionedCall/model_4/dense_71/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Reshape", "op": "Reshape", "input": ["hand_tower_input", "StatefulPartitionedCall/model_4/dense_69/Tensordot/stack", "^StatefulPartitionedCall/model_4/dense_69/Tensordot/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Reshape", "op": "Reshape", "input": ["face_tower_input", "StatefulPartitionedCall/model_4/dense_71/Tensordot/stack", "^StatefulPartitionedCall/model_4/dense_69/Tensordot/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/Reshape", "StatefulPartitionedCall/model_4/dense_69/Tensordot/Reshape_1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/Reshape", "StatefulPartitionedCall/model_4/dense_71/Tensordot/Reshape_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot/MatMul", "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot/MatMul", "StatefulPartitionedCall/model_4/dense_71/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_4/dense_69/Tensordot", "StatefulPartitionedCall/model_4/dense_69/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_4/dense_71/Tensordot", "StatefulPartitionedCall/model_4/dense_71/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_4/dense_69/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/dense_69/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_71/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/dense_71/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/flatten_28/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/dense_69/Relu", "StatefulPartitionedCall/model_4/flatten_28/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/flatten_29/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/dense_71/Relu", "StatefulPartitionedCall/model_4/flatten_29/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_70/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/flatten_28/Reshape", "StatefulPartitionedCall/model_4/dense_70/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/dense_70/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_4/dense_72/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/flatten_29/Reshape", "StatefulPartitionedCall/model_4/dense_72/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/dense_72/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_4/tf_op_layer_concat_4/concat_4", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_4/dense_70/BiasAdd", "StatefulPartitionedCall/model_4/dense_72/BiasAdd", "StatefulPartitionedCall/model_4/tf_op_layer_concat_4/concat_4/axis"], "attr": {"N": {"i": "2"}, "_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_70/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_4/tf_op_layer_concat_4/concat_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/classifier/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/dense_70/Relu", "StatefulPartitionedCall/model_4/classifier/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/classifier/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_4/classifier/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_4/classifier/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_4/classifier/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Reshape_1", "shape": [3, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_69/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/flatten_28/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_70/MatMul/ReadVariableOp", "shape": [168, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_70/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Reshape_1", "shape": [3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_71/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_69/Tensordot/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_71/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/flatten_29/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_72/MatMul/ReadVariableOp", "shape": [14976, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_72/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/tf_op_layer_concat_4/concat_4/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/classifier/MatMul/ReadVariableOp", "shape": [12, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/classifier/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}